export default Object.freeze({
    API_URL: "http://localhost:8080",
    //API_URL : "https://test.byukk.site:8080",

    STT_API_URL: "http://3.39.74.53:8080",
    //STT_API_URL : "http://localhost:8081",

    QUESTION_RECOMMENDATION_1: [
        '본인이 수행한 프로젝트 중 상용화 가능한 프로젝트가 있나요?',
        'CI/CD가 무엇인가요? 왜 CI/CD가 장점이 될까요?',
        '일정이 예상보다 지연될 것 같습니다. 어떻게 해결하실 것인가요?',
        '프로세스와 스레드의 차이를 설명해보세요.',
        '클래스는 무엇이고 객체는 무엇인가요?',
        '웹 서버 소프트웨어(Apache, Nginx)의 서버 간 라우팅 기능은 OSI 7계층 중 어디서 작동하는지 설명해보세요.',
        '데이터베이스에서 인덱스를 사용하는 이유 및 장단점에 대해 설명해주세요.',
        '어떤 기술이나 방법론이 좋아보일 때, 이를 어떻게 설득할 것인가요?',
        '웹 서버 소프트웨어(Apache, Nginx)는 OSI 7계층 중 어디서 작동하는지 설명해보세요.',
        '웹서버의 동작과정이 무엇인가요?', '팀원과의 갈등이 있었나요? 있었다면 어떻게 대처했나요?',
        'RESTful이란 무엇이며, 이것에 대해서 아는대로 설명해보세요.',
        '싱글톤 패턴에 대해서 설명해주세요.'
    ],

    QUESTION_RECOMMENDATION_2: [
        '싱글톤 패턴에 대해서 설명해주세요.',
        '클래스는 무엇이고 객체는 무엇인가요?',
        '프로세스와 스레드의 차이를 설명해보세요.',
        '팀원과의 갈등이 있었나요? 있었다면 어떻게 대처했나요?',
        'CI/CD가 무엇인가요? 왜 CI/CD가 장점이 될까요?',
        '본인이 수행한 프로젝트 중 상용화 가능한 프로젝트가 있나요?',
        '일정이 예상보다 지연될 것 같습니다. 어떻게 해결하실 것인가요?',
        '어떤 기술이나 방법론이 좋아보일 때, 이를 어떻게 설득할 것인가요?',
        '기술을 습득할 때 어떤 식으로 습득하나요?'
    ],

    SELF_INTRODUCTION_TEST_1: "어떤 일이든 성실하고 꾸준하게" +
        "어렸을 때부터 주변에서 성실하고 항상 꾸준하다는 피드백을 많이 받았습니다.\n" +
        "매사에 꼼꼼하고 이해하지 않고는 쉽게 넘어가지 못하는 성격이어서 어떤 일이든 " +
        "대충하지 않고 꼼꼼하고 정확하게 이해해서 수행하는 편이었습니다. 특히 코딩을 할 때 " +
        "소스코드 한 줄을 작성하더라도 꼼꼼한 디버깅으로 그 과정을 이해하고 더 효율적인 코드를 작성하기 위해 노력합니다.\n\n" +
        "컴퓨터 공학 에 대한 끊임없는 열정 소프트웨어학과에 진학하여 모든 과목을 꾸준하고 성실하게 배우고 다양한 팀프로젝트를 진행했습니다. " +
        "1학년 때 C언어를 배우더라도 개념을 하나하나 깊게 파고들며 이해하기 위해 노력했습니다. 처음에는 어려웠던 개념이 학과 동기들과 교수님께 " +
        "꾸준히 질문을 통해 해결해나가는 과정을 통해 쾌감과 자신감을 얻었고, 컴퓨터 공학에 점점 흥미를 갖게 되었습니다. 이후 2, 3학년 때는 학과 내의 " +
        "다양한 팀프로젝트와 Android 앱 개발 및 서버 개발 교육 프로그램을 통해 새로운 기술을 능동적으로 찾아 익히는 능력을 배워나갔습니다. " +
        "또 학교 전공수업을 통해 운영체제, 네트워크 등의 이론 지식과 실제 개발 능력을 함께 키워나가면서 스스로 성장하고 있음을 느꼈습니다.\n\n" +
        "현재는 졸업작품 겸 지도교수님 참여과제로 딥러닝으로 양치패턴을 분석하는 IoT 개발 프로젝트에 참여하여 Linux 기반 서버 구축과 운영, " +
        "알고리즘 개발, 그리고 앱 개발 파트를 맡아 개발 중입니다. 아직 배워야 할 것들이 많지만 열정과 도전정신으로 성실하게 임하고 있고, " +
        "이것에 매 순간 보람과 재미를 느끼고 있습니다. 안랩, 이름 자체로 신뢰가 되는 기업 AhnLab은 국내 최고의 IT보안 기업으로 기술력과 " +
        "연구에 대한 높은 열정을 가지고 있는 기업이기에, 컴퓨터 분야의 전공을 한 사람들이라면 1순위의 진로 희망기업입니다. 안랩에서 연구개발에 " +
        "참여한다는 것은 다른 어느 기업에서도 얻을 수 없는, 그 자체로 값진 경험이 될 것이라 확신하여 지원하게 되었습니다.",

    SELF_INTRODUCTION_TEST_2: "1. 소프트웨어\n" +
        "공학프로젝트 폭포수 모델에 따라 교내 약국관리시스템을 개발한 경험이 있습니다. " +
        "저는 요구사항 분석 팀장으로서 회의를 진행하고, 고객의 요구사항을 기능별로 나누고 분석하여 유스케이스, " +
        "시퀀스 다이어그램 등을 통해 모델링 하였습니다. 최종적으로 요구사항 명세서를 산출하였으며, 변경사항을 빠짐없이 기록하고, " +
        "고객의 요구사항을 제때 피드백하여 산출물 평가 부분에서 1등을 하였습니다.\n" +
        "\n" +
        "2. 데이터베이스 설계 프로젝트\n" +
        "과목별로 성적 처리를 지원하는 성적 처리 시스템의 E-R다이어그램을 도출하여 테이블을 구현하는 데이터베이스 프로젝트를 진행했습니다. " +
        "저는 프로젝트에 잘 참여하지 않는 팀원과 함께 E-R다이어그램에 대해 고민하는 등, 모든 팀원이 참여할 수 있도록 노력했습니다. 또한, 다이어그램에 관한 아이디어를 가장 많이 도출했으며 결과적으로 높은 성적을 받을 수 있었습니다.\n" +
        "\n" +
        "3. 모바일 프로그래밍 연구실 연구실장\n" +
        "실습실 컴퓨터 윈도우 재설치 및 PC상태 점검, 비품실 정리 등 각종 과 정기 점검 때 주도적으로 랩원을 이끌었습니다. 교수님과 조교님," +
        " 랩원 간의 소통을 담당하며 책임감이 생겼습니다. 그리고 이후 모바일 프로그래밍에 관한 관심이 높아져서 안드로이드 프로젝트를 진행할 수 " +
        "있었습니다.\n" +
        "\n" +
        "4. 학술 동아리 멘토\n" +
        "교내 학술 동아리에서 멘토를 맡아 1학년 학생들에게 JAVA를 가르쳤습니다. 일주일에 한 번씩 수업을 진행했으며 과제도 내주었습니다. " +
        "정확한 정보를 바탕으로 수업 자료를 만들어야 해서 개인 공부가 되었습니다. 멘티들은 수업 후에 프로그래밍 성적이 한 학점 이상 오르는 " +
        "성과를 보였습니다.",
})
